blog-posts/2006-10-04-emacs-gnus-hack-prioritize-based-on-the-number-of-recipients.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs Gnus hack: Prioritize based on the number of recipients</title>
<!-- 2014-04-30 Wed 17:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Emacs Gnus hack: Prioritize based on the number of recipients</h1>
<p>
October 4th, 2006 -
<a href="http://sachachua.com/blog/p/3920"><a href="http://sachachua.com/blog/p/3920">http://sachachua.com/blog/p/3920</a></a>
</p>

<p>
Ever found yourself confronted with an inbox overflowing with general
 messages that you can ignore and messages that you and only you can
 act on? Here's something to help you sort the wheat from the chaff.
</p>

<p>
This indicates how personal messages are so you can immediately see
which messages are just for you and which are part of a long Cc. Stephen
Perelgut showed me the feature in Lotus Notes and I wanted to steal it
sometime, so I did it while waiting for the Instant Rails archive.
</p>

<p>
To use it, add %ur to your gnus-summary-line-format.
</p>

<pre class="example">
(add-to-list 'nnmail-extra-headers 'To)
(add-to-list 'nnmail-extra-headers 'Cc)
(defvar sacha/gnus-count-recipients-threshold 5
  "*Number of recipients to consider as large.")

(defun sacha/gnus-count-recipients (header)
  "Given a Gnus message header, returns priority mark.
If I am the only recipient, return \"!\".
If I am one of a few recipients, but I'm listed in To:, return \"*\".
If I am one of a few recipients, return \"/\".
If I am one of many recipients, return \".\".
Else, return \" \"."
  (let* ((to (or (cdr (assoc 'To (mail-header-extra header))) ""))
         (cc (or (cdr (assoc 'Cc (mail-header-extra header))) "")))
    (cond
     ((string-match gnus-ignored-from-addresses to)
      (let ((len (length (bbdb-split to ","))))
        (cond
         ((= len 1) "!")
         ((&lt; len sacha/gnus-count-recipients-threshold) "*")
         (t "/"))))
     ((string-match gnus-ignored-from-addresses
                    (concat to ", " cc))
      (if (&lt; (length (bbdb-split (concat to ", " cc) ","))
             sacha/gnus-count-recipients-threshold)
          "/"
        "."))
     (t " "))))

(defalias 'gnus-user-format-function-r 'sacha/gnus-count-recipients)
</pre>

<p>
Random Emacs symbol: dired-listing-switches - Variable: *Switches passed
to `ls' for Dired. MUST contain the `l' option.
</p>

<p>
On Technorati: <a href="http://www.technorati.com/tag/emacs">emacs</a>,
<a href="http://www.technorati.com/tag/gnus">gnus</a>,
<a href="http://www.technorati.com/tag/pimpmyemacs">pimpmyemacs</a>,
<a href="http://www.technorati.com/tag/emacslisp">emacslisp</a>
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
